import React from "react"
import ImageSlider from "../shared/ImageSlider"
import TextHolder from "./TextHolder"

export default function MessageText() {
  return (
    <ImageSlider width="100%" arrowWidth="20px" noArrow showDots>
      <TextHolder>
        عقد مؤتمرات تعليميّة ووُرش عمل لنشر الوعي بأهميّة هذه المشاريع وتطويرها.
      </TextHolder>

      <TextHolder>
        إنتاج أوراقِ عملٍ، والمساهمةُ في أبحاثٍ متعلّقة بتطوير التعليم في أماكن
        النزاعات والحروب.
      </TextHolder>

      <TextHolder>
        تدريب وتطوير المدرّسين العاملين في أماكن النّزاع، ليتمكّنوا من تدريس
        المناهج الخاصّة بطرقٍ إبداعيّة.
      </TextHolder>

      <TextHolder>
        وفي مسيرتنا نحو رؤيتنا الاستراتيجيّة ولتحقيق رسالتنا على المستويات
        كافّة، فإنّنا نحتكم إلى منظومة قيمنا المشتركة التي ستبقى دومًا مرجعيّتنا
        الأولى والأساسيّة.
      </TextHolder>

      <TextHolder>
        كما تسعى هيئة تطوير التعليم إلى توفير مناخ تعليميّ متّزن من حيث الوسائل
        التعليميّة والأدوات اللازمة للطلاب؛ لتنمية مهارات الطلاب العلميّة
        والذهنيّة والاجتماعيّة والبدنيّة وعلى يد كفاءات بكافّة التخصّصات حسب
        المناهج السوريّة المعتمدة بالإضافة إلى المناهج الداعمة الأخرى، ويتمّ منح
        الطلاب شهادات معتمدة ومصدقة من وزارة التربية والتعليم.
      </TextHolder>
      <TextHolder>
        وتهدف هيئة تطوير التعليم إلى بناء شخصيّة المتعلم المتوازنة بجوانبها
        الوجدانيّة والعلميّة والفكريّة والاجتماعيّة والنفسيّة والجسديّة عن طريق
        اكتساب المعارف والمهارات والاتّجاهات والقيم الخلقيّة التي تمكّنه من
        تطوير نفسه واستخدام التقنيات بشكل إيجابيّ وفق مستواه العمريّ وتوظيفها في
        المواقف الحياتية وتهيئته للمرحلة الدراسيّة التالية، ويتحقق ذلك من خلال
        تحقيق الأهداف العامّة.
      </TextHolder>

      <TextHolder>
        التعاون مع خبراء في مجال التّعليم وتطوير المناهج، داخلَ العالم العربيّ
        وخارجَه.
      </TextHolder>

      <TextHolder>
        التعاون مع المنظّمات المحليّة والدوليّة بالإضافة إلى الجمعيّات الخيريّة
        في العمل على مشاريع تعليميّة محدّدة.
      </TextHolder>
    </ImageSlider>
  )
}
